Tekla.Structures.Plugins.DirectManipulation.Internal.Utilities.Utils
The helper utilities.

Tekla.Structures.Plugins.DirectManipulation.Internal.Utilities.Utils.ConvertLineTypeToCurveType(Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Converts a Tekla.Structures.Plugins.DirectManipulation.Services.LineType enum into a Tekla.BIM.DirectManipulation.Services.Graphics.CurveType enum.
value: The value to be converted.
Returns: The converted value, or Tekla.BIM.DirectManipulation.Services.Graphics.CurveType.Error.

Tekla.Structures.Plugins.DirectManipulation.Internal.Utilities.Utils.ConvertSurfaceTypeToFaceType(Tekla.Structures.Plugins.DirectManipulation.Services.SurfaceType)
Converts the type of the surface type to face.
value: The value.
Returns: The converted value, or Tekla.BIM.DirectManipulation.Services.Graphics.FaceType.Highlight.

Tekla.Structures.Plugins.DirectManipulation.Internal.Utilities.Utils.ConvertDimensionSizeTypeToMeasureSizeType(Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType)
Converts the dimension size type to the measure size type.
type: The value to be converted.
Returns: The converted value of type Tekla.BIM.DirectManipulation.Services.Graphics.MeasurementEndPointSizeType.

Tekla.Structures.Plugins.DirectManipulation.Internal.Utilities.Utils.ToFace3(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point})
Converts a polygonal surface contour to a Tekla.BIM.Geometry.Face3.
surfaceContour: Contour of the surface.
Returns: The Tekla.BIM.Geometry.Face3.